000001* Calculadora
       IDENTIFICATION DIVISION.
       PROGRAM-ID. USO-VARIABLES.
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WKS-NUM1		PIC S9(05)V99.
       77 WKS-NUM2 		PIC S9(05)V9(02).
       77 WKS-RESULTADO 	PIC S9(10)V99.
       77 WKS-RESULTADO2 	PIC S9(10)V99.

       PROCEDURE DIVISION.
       		 00001-MI-SECCION SECTION.
		 00001-MAIN.
       		 DISPLAY	"CALCULADORA".
		 DISPLAY 	"DAME EL NUMERO 1".
		 ACCEPT 	WKS-NUM1.
		 DISPLAY 	"DAME EL NÚMERO 2".
		 ACCEPT 	WKS-NUM2.

		 DISPLAY "SUMA".
		 ADD WKS-NUM1 TO WKS-NUM2 GIVING WKS-RESULTADO.
		 DISPLAY WKS-RESULTADO.

		 DISPLAY "RESTA".
		 SUBTRACT WKS-NUM1 FROM WKS-NUM2 GIVING WKS-RESULTADO.
		 DISPLAY WKS-RESULTADO.

		 DISPLAY "MULT".
		 MULTIPLY WKS-NUM1 BY WKS-NUM2 GIVING WKS-RESULTADO.
		 DISPLAY WKS-RESULTADO.

		 DISPLAY "DIV".
		 DIVIDE WKS-NUM1 BY WKS-NUM2 GIVING WKS-RESULTADO.
		 DISPLAY WKS-RESULTADO.

		 MOVE WKS-RESULTADO TO WKS-RESULTADO2.
		 MOVE 15 TO WKS-RESULTADO.
		 DISPLAY "RESULTADO 1".
		 DISPLAY WKS-RESULTADO.
 		 DISPLAY "RESULTADO 2".
		 DISPLAY WKS-RESULTADO2.
       STOP RUN.
