000001* Calculadora
       IDENTIFICATION DIVISION.
       PROGRAM-ID. USO-VARIABLES.
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WKS-NUM1		PIC S9(05)V99.
       77 WKS-NUM2 		PIC S9(05)V9(02).
       77 WKS-RESULTADO 	PIC S9(10)V99.
       77 WKS-RESULTADO2 	PIC S9(10)V99.
       77 WKS-OPCION		PIC A(1).
       77 WKS-ELECCION		PIC 9(1).

       PROCEDURE DIVISION.
       		 00001-MI-SECCION SECTION.
		 00001-MAIN.

		 PERFORM 00000-CALCULADORA.
		 PERFORM 00001-PEDIR-DATOS.
		 PERFORM 00002-EJECUTAR-OPERACION.

		 DISPLAY "#########################"
		 MOVE WKS-RESULTADO TO WKS-RESULTADO2.
		 MOVE 15 TO WKS-RESULTADO.
		 DISPLAY "RESULTADO 1".
		 DISPLAY WKS-RESULTADO.
 		 DISPLAY "RESULTADO 2".
		 DISPLAY WKS-RESULTADO2.
       STOP RUN.

       00000-CALCULADORA.
		 DISPLAY "1-. USAR LA CALCULADORA, 2-. SALIR".

       00001-PEDIR-DATOS.
		 DISPLAY	"CALCULADORA".
		 DISPLAY 	"DAME EL NUMERO 1".
		 ACCEPT 	WKS-NUM1.
		 DISPLAY 	"DAME EL NÚMERO 2".
		 ACCEPT 	WKS-NUM2.
		 
		 DISPLAY	"INDICA LA OPERACION A REALIZAR: S = SUMA, "
      -		 		"R = RESTA, M = MULTIPLICACION, "
      - 			"D = DIVISION".
		 ACCEPT WKS-OPCION.

	00002-EJECUTAR-OPERACION.
		 IF WKS-OPCION = "S"
		    DISPLAY "SUMA"
		    ADD WKS-NUM1 TO WKS-NUM2 GIVING WKS-RESULTADO
		    DISPLAY WKS-RESULTADO
		 ELSE 
		 IF WKS-OPCION = "R"
		    DISPLAY "RESTA"
		    SUBTRACT WKS-NUM1 FROM WKS-NUM2 GIVING WKS-RESULTADO
		    DISPLAY WKS-RESULTADO
		 ELSE
		 IF WKS-OPCION = "M"
		    DISPLAY "MULT"
		    MULTIPLY WKS-NUM1 BY WKS-NUM2 GIVING WKS-RESULTADO
		    DISPLAY WKS-RESULTADO
		 ELSE
		 IF WKS-OPCION = "D"
		    DISPLAY "DIV"
		    DIVIDE WKS-NUM1 BY WKS-NUM2 GIVING WKS-RESULTADO
		    DISPLAY WKS-RESULTADO
		 ELSE
		    DISPLAY "OPCIÓN INVÁLIDA".

