      * Hola Mundo
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HolaMundo.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       PROCEDURE DIVISION.
              DISPLAY "HELLO, WORLD".
	      STOP "PAUSA".
       STOP RUN.