000001* TEMPLATE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. USO-VARIABLES.
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.

       STOP RUN.


