000001* Ejemplo I/O
       IDENTIFICATION DIVISION.
       PROGRAM-ID. USO-VARIABLES.
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WKS-NOMBRE   PICTURE A(30).
       01 WKS-REGISTRO-EMPLEADO.
       	  02 WKS-NOM-EMP.
	     03 WKS-NOMBRE-TRAB		PICTURE A(20)
	     					VALUES "JOUSTME".
	     03 WKS-APELLIDO-PATERNO	PICTURE A(20)
	     					VALUE "DE FRAU".
	     03 WKS-APELLIDO-MATERNO	PICTURE A(20)
	     					VALUE "AUSTIN".
	  02 WKS-EDAD		PICTURE 9(02)
	     				VALUE 29.
	  02 WKS-SALARIO	PICTURE 9(05)V9(2)
	     				VALUE 788.22.
       66 WKS-APELLIDOS-TRAB RENAMES WKS-APELLIDO-PATERNO THRU WKS-APE
      -LLIDO-MATERNO.
       01 WKS-BANDERA			PIC 9(01).
       	  88 WKS-TRUE	VALUE 1.
	  88 WKS-FALSE	VALUE 0.
       77 GASTOS			PIC 9(05)V99.
       77 WS-HORAS			PIC 9(10).
       01 WKS-DIRECCION			PIC X(33)
       	  				    VALUE "ABEDULES #144 COLONIAS
      -					    " LOS ANGELES".

       PROCEDURE DIVISION.
       00001-PRIMER-SECCION SECTION.
       00001-MIPARRAFO.
	      DISPLAY "BIENVENID@ AL PROGRAMA"
	      DISPLAY "Programa de variables"
	      ACCEPT WKS-NOMBRE
	      DISPLAY "hola" WKS-NOMBRE.
	      DISPLAY "REGISTRO EMPLEADO: " WKS-REGISTRO-EMPLEADO.
	      DISPLAY "EDAD: " WKS-EDAD.
	      DISPLAY "NOMBRE: " WKS-NOMBRE-TRAB.
	      DISPLAY "APELLIDOS: " WKS-APELLIDOS-TRAB.
      	      DISPLAY "DIRECCION: " WKS-DIRECCION.
	      DISPLAY "GASTOS:"	  GASTOS.
	      DISPLAY "BANDERA: " WKS-BANDERA.
	      STOP "Pausa".
       STOP RUN.


